---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.CableTrayRun
source: html/2323158d-cd96-f3f4-3d89-8534ed957749.htm
---
# CableTrayRun Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.